//-------------------------------------------------------------------------------------------------
// File : asvkResDDS.h
// Desc : Direct Draw Surface Loader.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <asvkResTexture.h>


namespace asvk {

//-------------------------------------------------------------------------------------------------
//! @brief      DDSからリソーステクスチャを読込します.
//!
//! @param[in]      filename    ファイル名です.
//! @param[out]     pResult     リソーステクスチャの格納先です
//! @retval true    生成に成功.
//! @retval false   生成に失敗.
//-------------------------------------------------------------------------------------------------
bool LoadResTextureFromDDS( const wchar_t* filename, ResTexture* pResult );

} // namespace asvk
