//-------------------------------------------------------------------------------------------------
// File : asvkResWIC.h
// Desc : WIC Texture Loader.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------
#pragma once

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include <asvkResTexture.h>


namespace asvk {

//-------------------------------------------------------------------------------------------------
//! @brief      WICからテクスチャをy読込します.
//!
//! @param[in]      filename        ファイル名です.
//! @param[out]     pResult         リソーステクスチャの格納先です.
//! @retval true    読込に成功.
//! @retval false   読込に失敗.
//-------------------------------------------------------------------------------------------------
bool LoadResTextureFromWIC( const wchar_t* filename, ResTexture* pResult );

} // namespace asvk
